<!--Изучите и разберите мой код описанного класса. Создайте с его помощью какую-нибудь HTML форму,
 применив как можно больше методов этого класса.-->
<!--Самостоятельно, не подсматривая в мой код, реализуйте описанный класс.-->
<!--Добавьте в вашу реализацию метод для создания тега textarea.-->
<!--Пусть этот тег сохраняет свое значение после отправки формы.-->
<!--Добавьте в вашу реализацию метод для создания выпадающего списка.
Пусть метод первым параметром принимает массив атрибутов тега select, а вторым - массив для создания тегов option.
Пусть этот массив содержит ключ 'text' для текста пункта списка и ключ 'attrs' для массива атрибутов пункта списка. -->
<?php
